app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC
---
    def index
        @recipe = Recipe.all.order("created_at DESC")

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is my first recipe"], ["description", "adfasdfasdfasdfasdf"], ["created_at", "2016-11-07 21:53:07.925551"], ["updated_at", "2016-11-07 21:53:07.925551"]]
---
    def create
        @recipe = current_user.recipes.build(recipe_params)

        if @recipe.save

UPDATE "recipes" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image_updated_at", "2016-11-08 21:46:27.745200"], ["image_file_name", "1392647.jpg"], ["updated_at", "2016-11-08 21:46:27.902477"], ["id", 11]]
---
    def update
        if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
    def destroy
        @recipe.destroy

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_recipe
        @recipe = Recipe.find(params[:id])